---
kind: property
id: P:Autodesk.Revit.DB.ReferenceArrayArray.Item(System.Int32)
source: html/891d2fcb-c7c5-b745-55e4-809fe8ae763a.htm
---
# Autodesk.Revit.DB.ReferenceArrayArray.Item Property

Gets or sets a ReferenceArray at a specified index within the array.

## Syntax (C#)
```csharp
public virtual ReferenceArray this[
	int index
] { get; set; }
```

## Parameters
- **index** (`System.Int32`) - The index of the ReferenceArray to be set or retrieved.

## Returns
Returns the ReferenceArray at the specified index.